---
kind: property
id: P:Autodesk.Revit.DB.FamilySizeTable.NumberOfRows
source: html/8a85cfb4-3ff0-9781-34d8-bc7e771c2400.htm
---
# Autodesk.Revit.DB.FamilySizeTable.NumberOfRows Property

Number of rows in the table.

## Syntax (C#)
```csharp
public int NumberOfRows { get; }
```